app/Http/Controllers/Backend/Products/ProductsController.php

select * from `brands` where `brands`.`deleted_at` is null order by `created_at` desc
select * from `products` where `shop_id` = 1 and `products`.`deleted_at` is null order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `products` where `shop_id` = 1 and `products`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $searchKey = null;
        $brand_id = null;
        $is_published = null;

        $products = Product::shop()->latest();
        if ($request->search != null) {
            $products = $products->where('name', 'like', '%' . $request->search . '%');
            $searchKey = $request->search;
        }

        if ($request->brand_id != null) {
            $products = $products->where('brand_id', $request->brand_id);
            $brand_id    = $request->brand_id;
        }

        if ($request->is_published != null) {
            $products = $products->where('is_published', $request->is_published);
            $is_published    = $request->is_published;
        }

        $brands = Brand::latest()->get();
        $products = $products->paginate(paginationNumber());

select `themes`.*, `product_themes`.`product_id` as `pivot_product_id`, `product_themes`.`theme_id` as `pivot_theme_id` from `themes` inner join `product_themes` on `themes`.`id` = `product_themes`.`theme_id` where `product_themes`.`product_id` in (26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40)
---
    public function create()
    {

        if (request()->ajax()) {
            $theme = CategoryTheme::whereIn('theme_id', (array)request()->ids)->pluck('category_id')->toArray();

            return view('backend.pages.products.products.category')->with(['categories' => Category::find($theme)]);

select * from `products` where `products`.`id` = '40' and `products`.`deleted_at` is null limit 1
---
    public function delete($id)
    {
        $product = Product::findOrFail($id);