app/Scopes/ThemeCategoryScope.php

    public function apply(Builder $builder, Model $model)
    {
        $middlewares = Route::current() ? Route::current()->gatherMiddleware() : ['admin'];
        if(!in_array("admin", $middlewares)){
            $active_themes = getSetting('active_themes') != null ? json_decode(getSetting('active_themes')) : [1];
            $theme   = session('theme');
            if(!is_null($theme)){
                $theme   = Theme::whereIn('id', $active_themes)->where('code', $theme)->first();
            }

            if(is_null($theme)){
                $theme   = Theme::where('id', $active_themes[0])->first();
            }

            $ids = $theme ? CategoryTheme::where('theme_id',$theme->id)->pluck('category_id') : collect([]);
---
select * from `themes` where `id` in (1) and `code` = 'default' limit 1
select `category_id` from `category_themes` where `theme_id` = 1