app/Http/Controllers/Frontend/HomeController.php

    public function index()
    {
        $blogs = Blog::isActive()->latest()->take(3);

        if(getTheme() == "default"){
            $blogs = $blogs->get();
---
select * from `blogs` where `is_active` = 1 and `blogs`.`deleted_at` is null and `id` in (1, 2, 3) order by `created_at` desc limit 3