app/Http/Controllers/Frontend/ProductController.php

select * from `tags` where `tags`.`deleted_at` is null
---

        $products = $products->paginate(paginationNumber($per_page));

        $tags = Tag::all();

select * from `products` where `slug` = 'cinthol-100g-je9gl' and `products`.`deleted_at` is null and `id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38) limit 1
select `categories`.*, `product_categories`.`product_id` as `pivot_product_id`, `product_categories`.`category_id` as `pivot_category_id` from `categories` inner join `product_categories` on `categories`.`id` = `product_categories`.`category_id` where `product_categories`.`product_id` in (36) and `categories`.`deleted_at` is null
select `category_id` from `categories` inner join `product_categories` on `categories`.`id` = `product_categories`.`category_id` where `product_categories`.`product_id` = 36 and `categories`.`deleted_at` is null
select `product_id` from `product_categories` where `category_id` in (18) and `product_id` != 36
select * from `products` where 0 = 1 and `products`.`deleted_at` is null and `id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38)
---
    public function show($slug)
    {
        try{
            $product  = Product::query()->with("categories")->slug($slug)->first();
            if(empty($product)){
                return view('errors.not_found');
            }

            if (!$product->is_published) {
                flash(localize('This product is not available'))->info();
                return redirect()->route('home');
            }

            $productCategories              = $product->categories()->pluck('category_id');

            $productIdsWithTheseCategories  = ProductCategory::whereIn('category_id', $productCategories)->where('product_id', '!=', $product->id)->pluck('product_id');

            $relatedProducts                = Product::whereIn('id', $productIdsWithTheseCategories)->get();