app/Http/Controllers/SetupController.php

    public function storeAdmin(Request $request)
    {
        $user = User::where('user_type', 'admin')->first();
        $user->name      = $request->admin_name;
        $user->email     = $request->admin_email;
        $user->shop_id   = 1;
        $user->password  = Hash::make($request->admin_password);
        $user->email_verified_at = date('Y-m-d H:m:s');
        $user->save();
---
select * from `users` where `user_type` = 'admin' and `users`.`deleted_at` is null limit 1
update `users` set `name` = 'Admin', `email` = 'admin@gmail.com', `password` = '$2y$10$VqoZtSsytI9J2d515FtTqueaSPcfkBRUQ9xZczEatSf7uhIqc8LFa', `shop_id` = 1, `email_verified_at` = '2026-04-28 14:04:43', `users`.`updated_at` = '2026-04-28 14:14:43' where `id` = 1